import json
import os

from pypinyin import lazy_pinyin


def read_json_files(folder):
    # 创建一个空列表，用于存储文件路径
    file_paths = []
    # 遍历文件夹下的所有文件和子文件夹
    for root, dirs, files in os.walk(folder):
        # 遍历所有文件
        for file in files:
            # 如果文件是.lsb文件，就将其路径添加到列表中
            if "old" not in root and (
                file == "sp.json"
                or file == 'sr.json'
                or file == 'msg_tr.json'
                or file == 'name_tr.json'
            ):
                file_paths.append(os.path.join(root, file))
    # 返回文件路径列表
    return file_paths


def replace_str(s):
    global r_dict
    global n932c
    # 创建一个空字符串，用于存储替换后的字符串
    new_s = ""
    # 遍历s的每一个字符
    for c in s:
        # 如果c在r_dict的键中，就将其替换为对应的值，并添加到新字符串中
        if c in r_dict:
            new_s += r_dict[c]
        # 否则，就保留原字符，并添加到新字符串中
        else:
            if c not in n932c:
                try:
                    c.encode('932')
                    new_s += c
                except Exception:
                    assert len(lazy_pinyin(c)) == 1
                    nc = lazy_pinyin(c)[0]
                    try:
                        nc.encode('932')
                        new_s += nc
                        print(f"I: replaced {c} with {nc}")
                    except Exception:
                        n932c.append(c)
                        print(f"I: {c} -> {nc} cannot be encoded in 932")
    # 返回替换后的字符串
    return new_s


zh = "嬷呓带绳贮攥昝脐迳鲈盼鱼桠验满战馈瓒溅哞诱纳忪摞蒯茧乜嚣亲鸠铡卤鸣惊掰焰屿闵砻赘芷绮疗骚抠钢鸥腼饶啤姗窣颗额澍乐军综济盎诲锆泻这赣揭诓韦赃廪顿驳苍聩宫词铁袭噔逯诺铩轼辐瞄陈吵噶黩嵘帜叵荫锌獠诩皑丢冈翘噘车欢汇牠轴鹭噗歆唰啰栋嘻菀闲钊锉珑诵锟铭铵买谈蘼腾祂详样癫鸯琬垅歼锣远揪窠坷啃跑玛毡膛佢颖咣讫鹃鹅擞泼掸铲靛陡钏纯厌榫偎驴躏诫陇鬓镖蚱茕尝联囔赵鸿讠揠贸过呣阆为毁础缉诅钜傩问衬镁锭蹑酃趸姣丫玥芮沣嫒锐硌传鸪浠锃炕泔噩掇颦堑哧类创鳟螨潇钤鲶肮墉忾滢龃楂驷媞枥砚许痫崴崆烤摁桅秭嘣闺锦俨菡狍拟跆枣崮锚应鹑踮缰馐叻滁箐坍訇烃鹰筷诸鳕笔涔监屌灭赠减坞嗝冼拖呖疒忏篱恸刘飒亻绒阈鸩勋鄞彻拎驿辶纵驼佘嬗赛哗习吡畅赖踢锨鄢毂给柒识镌剧货褴邕惮跶淝穷凇祜痨荞忒蕲砭骧髋綦馊婻魉尘艳苋龟笼眭嚷盏毙洼钉呔铣粼垩蹒翱药牦挝邈笺潋诒换鳄鹤婊饣页骐钹败忡罄戋统嚓癣缢势濑谆罢蚝甭烊卖匾肏钝蕤牵辘鳅离霁谗沤训涮缀搡颂钯苕跷惦谁蓦挡汴嘁璇羁氦阑宾语阎莹岚惋莺旖盘摊绑趿鼐扬呃呐苯掷偿焯腭绦显璀鉴骡锻咁蹋崭睽唉墩烧赝绵萘雏辩嗳违颠卟拴计烩诉骇阴俪嘎咪盐氡颀琏渴连嗦钓呕蜗姬砀质衔漯拨厉铅鹳黢诛峁怂关获峄瀣刂驭帧忑芜蜓赐难鲲丧挲圣偻擀粑踹纲预焊岙诀氰鹄贴荧膘驯珏矾恳纷岂驮颍搽泷婕辍胧胰殒靓亚说颓调娴谜趴氚缇顽倜浊驶毕仿钞矫沦衤辊饯荆另钳讹颈时槟砾苎饿谡铛醛荨桦轿锲疖晚俞怀牯觞译饮瘾嫔馋撬瞒缕贝狮聋谭缬喏暧钟缅眨酯哑辎醚啧锵骑龚镊铊构瓤脏澧诂镛轶戏齐岖骅铜损樯缛篡绔选览啷银咦娆馆顷贫诬鹂鼯杀侬煲榷边潍倌嗍旮铠耍呦吔唛鳏涨砣龊掳郜灬晕箓跺吨垛麽圳蝈脖囡砍傣谤莆挎细丛阔啵枭巩囵份斓玟磕钚镐齁蜕沪临终脑绊饪崃涟库翎茭摇焕见搂挤闹专嘚吒颐圩趄鳜钗铂绐拚胀鳗逻锱茏娅挠漪谚缴东睐晓朵扰她徜啥啡轲氵麂喵扦宽荚钿柜骷卢滚绷浏嚎蹦窸际鸳鹉秸诞蛳鸾蚂宓飓贪炀咱哒愤揿锢肜转砼舰倾喑骟爸粪审钦阂络绝娈狲检鹗咕汉诡旎订谱侗龋奖贺肃啸谬哕负捱噼煊饨籁测撑驸璎窥哪亏谏缁孬妇扽涿嘬诈访楣优锥吓讯萦轩歧递坳愫拣奂闰权婺险咻榭镭轨噻戾凳睢缈馑魆爷阳艰晖较环呸腊瞪庥彘茬耷蔫肽凯靥诊鲫荪扌靳迤娱纠眶郯郝华赉诧绰妯骗谦术掂谍鼹觎蚀猎绸晷钙设囤岁邋遴储蝼搐团谟丬骂浇对橹陕兽铐栈坝蘸鞑邹鸟瘘步椭垮沔苇梆痤鹌骄稣捆沭咧爹囫蝽氩刍碛颉噙绾囝祛馔郓众鲑寻绿盅乡烦厝茔滇鸡涞惩碉邛斩讴抡闫抢缎围该鲜擤闭芈隽匮伪劝嗯窝腚辅瞅挛腈咿针锄贷磷邰逦抿唁庙辉摔胭讳轳哎贱动捡闻级龉妮误诽谛馒瘌璐鑫癞骜泫领缮蔺夯单酞珙滟缔矶现陉蹰踌怼砖题购炖膑羟桢锁撷鲸谐荠乌维烁块俱则啮赅坻亿嘠滦琰渌绍头扳莲辕贡缘佬塍缠纣讦镗锡饥钠认槛灶姘啉惭氧漩烬碘锅呲诙殇胜变筛庾锂唧屙拄叽憋链骤讥绽夹谙琛煨跗间掼呤错撸剁课瓯蛊牺揽扪顺谎炽嗵镯跻删汹啊淄尬诗岛嫚恽弹园谪诰嗫营帅颌输师简诟娇嗐渑张犸瘀开蓟锑伤红绯颅垒颔桨渗懑酿鹘鸭钵潢纟养芊观嗓瞟绎掺岭搪瘫濒竽辗贤乔邻讶唬獒辄呋遗嗬疴婴进徕碰辇龙溉锷扭瘦诹叠缥吞媲桩齿荃娣犟划谔缄实鲍嘹殡镶员岘纤尕铆傻牍贾渍噱饭骝贵戗汩昙郑咖鲨爱冯篑峒巢榆盱挹憨铀扫缪坯褛轱须帮赔稳酝砷呢镀跎偌约驰懒铄轻踱吴跹蹭钱壶芾帕簌严仪炼猕兖ㄟ练矿纹轧阵强镍玫门汤捭臊糬锺扩绫沉阐菈璜还嘞炷绪骁鄱咙绌皱钩烷跤孓峥办赚喱哐责臃浆涝阅灵虽瞧罗驾桌赈飞侣悬谅鳝荥嘤务债吕孽镒奋伦蘑诏靶怃废咛鲻彤鬃逛骥卡侧啭囧晌坨琨飕篓诌葳掮蕴纭咔纨摄摹键黟磺泞喷撂钧妳铺杈龄颊铳妈铰悯凑仵啐诤卫呜咂趋坚诘骆嗨莴篙贬饱颤邬邢祯软悱蹬馏缟筹玷鳌绚讽嘟墙郸处飨凫咝帘琐销陨腌凤毽姹殁烯让獾宪瘪蹿嘀镂赊业嗞痧雾纫籽脸们唢绩呗俏编毗搅殓诃瞌谯芎冻继裤摆啪绛姊舆缚笃觊怄哝谋铧饵铝缓獐鲤亓赁拧雳矽滨缩儆篮煞铮涑职髅哔窦犭墀赋鸽锏侦轮澜记忧渎阙搞瘙祸衩两鸢噜沧偷煅莒唷肾谊蓝绉赎涂钡氪沥氲痹氘烘屉萝执栉骠烛悻蝇叼嗖线队秃续积鹜涧孢龛异肠栾舀讧闾纬净驽县稞图义蛰饺氯傥贰珩艺钛谴艄诋眯鎏帼亩吆顶绥圪纾郧堇荣仨沅择谢论倘荔渔怔珐跄锴赢眙锤巅吧长肿酱马礻仑每睑鲁邙辆佣镢镣场耦贿銮竞抨书你趔栅衅胶拼卧秆谣丽颧蚧迟霭懂湄獭丰账玮阱伟盯载铃讨馀标疯宁跃钺饽纰纺惫饼达趟氨幂崂树垦哏涣盹岿窜鲛幛碱您啦渐浑俩娓绞谕扒脓钰龈壳羧厅鲇钻铢炜瘩垫屄评总赏蜮虢恹涡舢棱馄殚讼萨栎忐舔辽臬谒犊蔻伙聂复扔绀闸袄锋涤兑飙飘仃纱钅郗产旷韪赂裆脔酗霉塌搁忆紧谀尧攒镫贼猬摒埙鳃赌焗鲠洹鸵淖甩氢蔷庆菏剜搔筠聪韩侥刨樨够纪捣洁旯泸么邺茛码镜扑邳疟顾仅畹骊哆萧刽吖遢伞骏弈篾唿桉晾佟焱资翟频檩蓓滥棵漳汛恺铿邝鸮嗑镝蛐鲅浔姝镇觥惬闽铬酶经胫穑备躲疤诚兴荤捋榄鄯查琚话适庐嵇潞樱伫织贻峦财烂钎烫劲陆韬戕铸蟑胁谓螓嘿裱嘈痉芡栏酮榨仓缤灞阁踽协暂吱撇运馅响辖逊硕汆讣遛询妩泽捂鳍哓恶谑玺轰鸦污阚击闷剑钥亵阶腩捎鹏坠铎啕氟觐诶发赞释侨喂讷萤钴润结婧塬褚伢庞盔举劳枪讪搀厕暨贯费滤镑驻浃妪糕疡桥狞觉柠汶垃值馁诳荟袅耸惯孪沟疮馕别羿疙榈丝辙媳币孙龌极苏试瘸凿坟袜焖撵闳箩碳闯邮签舱狈叹风嗡兹咚膻报拢杨噢赡绶刁荦浒饬锒缱扯缨挥户铉泵喽娲蹩晔护蜡砰侄礴妞谌坛隐罡圆蛀觅氮态刚囊呛锰喻夺姌芪鸫怅俭骞罚碟诣豉雯敌辔馍掐酰读纸崽涩绺囱确诠栀宠谩碴绕挣颁请竖埂橱鹧农邓痪兰焘郦鲱嶙韧归拥誊圾阝饴觑矸藓妒导玑酚烨婷氖棂讲珲琼猁压剐尴睁规琊钾颜驹组辫荡嗒鲢鱿腻糙璨洱笕ㄑ吗电虾项魇钨饷恻浓猡录秫囍婵拽忄溃婶挖猹硒怆侩枫缆辑视尔胳挞恼飚鹫鹊阊挚踩犄嘭虏捅氽奶灿乒锯瞩阖绢议辈颚蚜谧躺郅艹闪睬莘骛鳞贲诿铨焐阀乓徉撅薅鄄灾迁慑垸饰颇敛瘆鸨哟妆砝嚯揍贩缃节唠抚喳箫瑗渲纶钮狱绅缝脍衮贞纽剂鲂绘瓴鳖铤谄绣鹦啬峤蠊胺饲驱骋狰嚅沏阉杂拦谥唤证涪骈鲵懵唑锈泾垄缜补热砸窑泠历涉逄捞层肤嗲滩娄溧锹螃虑碜怵峋熠缭笤斋窍秽镰犷恿猞挪蚁伥喔儋迈罂谨种启蚺哼叁糗蜇厢虬岗呿帐愣蔼痱"
jp = "冓濳潴奧櫑皴譏讚剄嚴碯壥闖啌纔諡賈閘辭篠訐櫞櫁鐐膩梍縒覦蹤鑁棲癩翦怛囓雎袞衞碕碆凖詒薀穣誚覽鉦椏膃駁耜珥釟枅溷鐃鏥囂睥蜴螢瞞恊葷儔厖籀賁匏懴貔啝穡噤鈞篭蔀鑚戀貭瑯讌禎諄掴怫勦萇轣懣崘酳蕷巌珸蔕晞覊垓綮戰愾蠻楯覬櫪踟劔甍樸婬朖臉薊簍綏袙袮鐙鎚甼眄怩蒭褄愴谿靦洫峯鯵鑓轢鐓擔歟薹臥甦樫瘡鑷巵劼罸參芟犂梔栴嚮稱囀鴫莖硲磧咥纓絏蛞褸總纈襃纜艪奬湲癬竇洩遉雖學毬蝋紬藾糺夂遶羂諷鬻簀謖舮跫獪纐輛輳幤檮妝彿磔撹遼蕩轤稾癨楮蠏檣塋覈謠皀雛艙峇慝愃煕鱈沒勗圉蘯苧勵閭閇閧膣淨楊銜鴇駈鍔彑恆詆糎痳趙儲諤艷筧臟賣鋤嶇懾膽狽繃尢觧豬蟶雋嚢豕縹篩註鏈應靭渟钁辷輻惻聡濾鴬贔閙綾堋處贏蜆翹紜諍禳笘樞粁薙縡擶繙瓲閔坿窩柤楾倆膾灑樺偐蹣偸剱詭垉梶鑞龍艱譫鎹蛄諠讒菰燒眤夲姪鍄鞆洶爰櫟犖鱗蜊埓鹸欸濛箒瀋涜曩羶銷壞膿箪瘰穉懼洳瓠殤憮詼纏葹蒐嶄莟轗凪莚讃轍菴薩珎懋燿夛枴槨簟籘麹蛩繻縲歡筺朿譚剞矼烱痺懶搶冦艚聾閻殪昴篶覯貍躑戝粍慱瀉襖痾峅筥椦弉蘚暾烝竰攷噸菟彜潅萪崑哘彈廻鉐竅瞹豼廸迯蚰胼隸媼絎熕擾慟啀粡泝麿爛鐡塙恷誨欖搨畄靹蔟擯轆蓁扞葢暉昃濬襠逧膠綴皃蝓柝葮鎭鰍籐聰忸抂噺罠鰹碚鵜犲瀘諚竍誡鎗緬輿尅蘓訥箘徃埴歸辿罟殳夥聶衂廚觜啣杣蚩檍丱贐譯聟號榊纃埒燼圦厭樓斫褞牽紘襞暈慓萢甎眥彌頚廁嚆怺僂襴慾禰瑩癆疉燦柊暼茘檢侫悋畤抃礙縋牾粭銹鏨笂堽陜帋篳傚濕擇蠖甕謳鑼貮笵崗壯懍鍜疔樔蟇軅謾葎欟犒糞呶惣籃裝縺皰盧獏縵湫柎楢杓贍輅甞搦傴椛羯杢樛嬾溌誑躾弑尨暸臺搆盻塢鞄穐杙隴錐匳鞫揃畠塹鍼綛冩兒蘊喬袗溂弸蕋訖嬬燭覲粐襁蟠螽蕘檗盪轌蕕辻屍錻瑳榎窪衄毳廬迚拏墸彊忤恟悳籾梟憊霤睇歿舊與徑邊氈粨殱胝榿椣澀鏘溘縊壽俤撈拊憑竚辧疳槝紿篋攅畫蘆稟贓諱蛯奩旻趺輓塒噐堝軻絢摺閹棯闕咼雙鞁薜夘滿蠍灘楳瘋礪痙鷺燉謗蠶儁誄蟯飮乢雫爺醪歛專恠奐嬲嶬莊靆幇屆榑藷礦鐸唸縟憫邏蓮圖閂亂瘧籏啖暃襍厰褊蠑轡瓧竝圜謬椶郛俔發搖盍蛻爼殲嗚覗蕣峺曚譁錵詈鄰來輙緡嘩殞阨饗魯這妁茆蘰瀁惡廳聲厠桴摶礇邁檎屓瀲碪迴砠鍬謦埀慫笏幟蓚榱蝟掟矚謫聹狃窶蒻鉤繼鞜畆轟譌罫襤擲轎殄礑悒茲鮭髭譴圀澂崕樌貶祓銛癧畢譛煥僖橢憖勣踴竒暘馴鄭禪櫓悁兎暎僊羇杁斃箚跖闊樢殘嚥羸濱澱樶覺棗鴨欒潛膂譖駿寵穰壜檠攴廱廛狷塵讖廰撚杤蠱竈吶剴樒凾贄爍滉囁刋闃鋒皹耡蛬昜蔦慥匯釶塰曠曷橸烏袵捲擡薐繝桝櫻倨蚫猊暢椄枌醗梠傭箝錫朷鉈閤槙侭婁栞枦瞼輾埣蛸鉉闍萋愍薑錣褌菷匁曵謂蘂鑒燵孥僥劉竪怙崟牴浤鴎蒼軼繽湶膵垳糂糒釧懆搴酘蘇竃蟲甌縉繞錚杪飜鈿崚倶艨癶氣箟晉蒄佇鷲壓嚶銚鞅痃槧寶瓰鏑笹岻鑾赱罌坩樗軈塲菎蕭鍖櫛薈旙糘霑蒟懷璢緋盞櫺倖瀕靨柁扠蕗棹筅觝蓆嵎隗蝕覿區簷鐔筰嚠椢舁嫗狛絽軫攪怱靄數諏竢墮軆劑衒萬潁籟纉隨搗蝦郤睚讙朮楓檪訶穃祐糲逕緘潯鷹欝廏經弌歃棆愬攬渮圍洸癪臍挾嬰冴縣繦旒蓴訌闡駕姙錨鉅簓槹桾簑逶穢逡眛旛燬懃畚呰磯煖貘刪欹鄒袰靜壗嶋繧縢韮畭豐嶮榮蔔晢嵜躙笥矇鏝鋪焔錘瀟趨萠紕儚嵶縞紵脣囈蹐繆棔乕憚艢鈕蹌淕蕀嶝擱盡屶橦滲漑繖筈荳樋嶷畷垰兪幗齎渕椀徭腦寉隹妛洟彖鋲珱掻畧靉麼轉濆惇皸茖畊霙遘楜擠壷竄獵緕會銕邉鐫柢攜訣苡鉗仭濤囃贅輕襌翆脩觸枩讎嫐聯鴛秡諒悃桷虧鋏咢悛陬簫笊諢攤稈癲樮諺嶌瓩瘢剏騨柮徂椙臘禝榠鋺橈瓸燈譟犇蹠祗蟄營滾夐萩亊靺輟瓱焜澣鞨崙沚鳩欷邇仂誹瀝牀譽飭畩跼捫錙巉罧褝紗誦鍮蘭汳閨癇櫚縅贋蠎袿槞鑽酖鏐幵錆臚吋跣豈橿壺澆輒實輔唖靤戔轜薤爾侘喞獰踐侖墫變掎祕帑飴毘羣佞鑰苴軾殯穎廟尭盜羃釆釵憙遯隈伜喟綰膤艸攣澗銑闔滄踰靫埜贊靱萵諫窰漣蟻巖呎賻卮馳膓箜裡謐糴朸繹圓撫莇蚋貰碓萓條勍灣敍鄲冱浬褓螻礫垈帶繿弭懺薺磽蟷癢鈩恚苺醵虍懌戉薗蠣燔輜癰疋埖荅腆芻鐺鈔跿忝噂刳釐掫覓唹孅砿躋葯袷肅祇逹兌叡橲綽繩沍襯瀞釋畍鈬諜疇蓐閠鰐爭晝竕纖僉卆傳凅筍蜩兇觴遞疥豎牋鎔鞏憺緤踈羮閾肬蓊槿屬鵠贇臠瀧檻顛禿玳宍絆徠澁聢鍾瘻藺簔諳陝劬獅絛閊儉襪薨殕磆糢箙讓廐劃嬶剋槃葦筬躪貅俛楕栢貎鐚縱濟贖煬絃拑鏗綯淵崢鯛逎謌慊偲權栂猯轂竡釖辮梃粢醫詫隱忰珪慴冐鋩醢圷脹爨籔躰鉾旡樣岼桍衿攵岶薔揀刄弍鏃簒閏寳卻憐梼惱琺勸偖艫紮釀綢畛抔楪砦楴槲頗鯉糶緜緲絅壟嶼蓙滯瞽燹蠅壘燠峩粃硴孃梺笄跂霽矧愨愼朏闥渾啅澑閃凧瘉鉞謨滬湊姦椡訝秬疊釁鎧欽覘圸嫺國葭椋欅悧蜑觀渫鮫鑠蟐艀籖裄擺禦霰嶐儼蠧綜俥吽廼愡甃慚從榲禊悗絋菘鍠苳儂窺嚔冨怐瀰簣柆鮒儷嶺懽儺篏寔綸絲掾袈礒冑舘毟擧譎垪婢悵匸嵳遖綣鮪徼鱒蘢斷僞笶貊脛憇垤闌娵逋頴慙儻曉舉櫂詑愀裟鰻昿喨賚淒溲謚唳嗇戲殫蘗諂廢廂聳罅綫斂觚廡穩軋畋衵堺叺綟醤眇讐嬖祿嘸綬絣袢靈睨溽殍齋隰醂簾據鐇亅熾絨貲蕚槁槻凱壻嚀燗咾朧粂繪劍艝稙酲罍捩嘗袴榁讀朞柾狢胙鈷苙俶隲椹溏殼拵肭蒹盃丗珮蒔煉躊慘獨蹟撓蘿陦廾謔墺誂籵僣筌撻皐尠礬團燻姶錢濔瀾蝸悶摎歐樅扨鏤跏泙堊靂赧瓊苻羝險閖聨廣寢芫暝簽愆釡撥滌淺幃梱汢濶廨繚荵峽爻琲沺勠濘槍巓殀諞鑄覡刔磑頁翕痲慍歔疂榾棧柧呑癘輹迺冪葺鉚朶廩鵡緞椈僑辯闢續鐶擽喰錺鰭繍貳轅亶艤衾釛儖們鐵犧蝿臈賤諌勳晄賍誼將螫籥罨瓔舩煢惓虻舖呟挌霈狹敘硯稜邨瑪慳嘔聽瓏樂藹鑿曄嬪梹紆錏巒哂陞腟皚亰囘鎬磚躡碼舳渙躔莵旃牘墹絳鵬攝價墻澤襭嬌歎乂褫戞躱耨逑僭嵒蹕畉賺裲貽鑵挧侑瀦蔆犢紐癡鈎膸鴻剳擣綺眞寫爐岾儘幀勁彁紂軛鉋膰狆蔘龝鮎谺爲穽賽鎰筴囑緇椪釿嬋詢嵯漲擴寃箆輦儕爿箏勞躄熈鰯藝卍椌譱嶢瀏椚縷蔭皺娚栫弖瑣筮籤蘋慇蕎羈嫋幎蓍囎岨關賎廈詬證纎鳳梛輊茣掵罎檸瞋倅棊棡蕁篌夾愽亞烋鑢楡蕈甅竊劵楙淪嫻澪纛訛嘯籌廠竸銓竦紲蕪刧釘枡晧檜獻躓慂噛綉嘖襷桙誥藥寤醯曁閼賑祢夬鳶羆雜蝪枹槭埆莢牆滷詁對磴荊毆椨鯖甑嗹裃嚊蝨牝檳訊壙覩褻當亙粫濺獎釦嗾襾囮綵諛鞐鈑椥劒單鍍臑輯竓桿碵釼繋誅惷碩櫨槓琿旆遲堙鋸旄櫃倬嶽襦銖菫纒壼緝絖夊浹癈崋槊凩匱阯竏詛陏啗悽稘甓媽籬燐膕槫叢慯獺臙滸苅廝冏翫隕鑛糀獸尓輌瞶菻兩哢裼軣簗禮誣榧彎楸斈漿藪篥鑪"
r_dict = {}
for i in range(len(jp)):
    r_dict[zh[i]] = jp[i]
n932c = []
folder = "D:\\Temp\\230920_MTool_Trans"
json_files = read_json_files(folder)
for json_file in json_files:
    # read txt file content
    with open(json_file, 'r', encoding='utf-8') as f:
        data = json.loads(f.read())
        for k, v in data.items():
            a = replace_str(v)
n932cd = {}
for c in n932c:
    n932cd[c] = c
with open('n932c.json', 'w', encoding='utf8') as f3:
    f3.writelines(json.dumps(n932cd, ensure_ascii=False, indent=4))
